app/controllers/live_controller.rb

  def index
    render inertia: "live/index", props: {
      samples: Current.user.samples.with_attached_audio_file.order(created_at: :desc).map do |sample|
---
SELECT "samples".* FROM "samples" WHERE "samples"."user_id" = ? ORDER BY "samples"."created_at" DESC  [["user_id", 258008703]]