app/controllers/samples_controller.rb

INSERT INTO "samples" ("created_at", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?) RETURNING "id"  [["created_at", "2026-07-22 00:55:31.002106"], ["name", "Doomed"], ["updated_at", "2026-07-22 00:55:31.002106"], ["user_id", 258008703]]
---
  def create
    sample = Current.user.samples.new(sample_params)

    if sample.save

DELETE FROM "samples" WHERE "samples"."id" = ?  [["id", 1]]
SELECT "samples".* FROM "samples" WHERE "samples"."user_id" = ? AND "samples"."id" = ? LIMIT ?  [["user_id", 258008703], ["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 258008703], ["LIMIT", 1]]
---
  def destroy
    Current.user.samples.find(params[:id]).destroy!